/******************************************************************************
文件名称: ADC.c
文件标识: STC8A8K64S4A12
摘    要: ADC硬件操作函数
当前版本: V1.0	
完成日期: 2021.02.03
*******************************************************************************/
#define	USER_ADC_GLOBALS
#include "include.h"
//#include "wifi.h"



//#define Interrupt //中断方法
#define Query     //查询方法

/*****************************************************************************
                ADC全局变量
*****************************************************************************/
int vcc;  //电池电压，单位mv

#ifdef Interrupt

/*****************************************************************************
函数名称 : I2C_init
功能描述 : I2C初始化
输入参数 : 无
返回参数 : 无
使用说明 : 无
*****************************************************************************/
void ADC_init()
{
	P1M0 = 0x00;                                //设置P1.0为ADC口
	P1M1 = 0x01;
	ADCCFG = 0x2f;                              //设置ADC时钟为系统时钟/2/16/16
	ADC_CONTR = 0x80;                           //使能ADC模块
	EADC = 1;                                   //使能ADC中断
	EA = 1;
	ADC_CONTR |= 0x40;                          //启动AD转换
}

/*****************************************************************************
函数名称 : I2C_Isr
功能描述 : I2C中断处理函数
输入参数 : 无
返回参数 : 无
使用说明 : 无
*****************************************************************************/
void ADC_Isr() interrupt 5
{
	ADC_CONTR &= ~0x20;                         //清中断标志
	ADC_CONTR |= 0x40;                          //继续AD转换
}



#elif defined(Query)

/*****************************************************************************
函数名称 : I2C_init
功能描述 : I2C初始化
输入参数 : 无
返回参数 : 无
使用说明 : 无
*****************************************************************************/
void ADC_init()
{
	P1M0 = 0x00;                                //设置P1.0为ADC口
	P1M1 = 0x01;
	ADCCFG = 0x2f;                              //设置ADC时钟为系统时钟/2/16/16
	ADC_CONTR = 0x80;                           //使能ADC模块
}
/*****************************************************************************
函数名称 : Wait
功能描述 : 检测状态
输入参数 : 无
返回参数 : 无
使用说明 : 无
*****************************************************************************/
int ADC_read()
{
	int res;
	
	ADC_CONTR |= 0x40;                      //启动AD转换
	_nop_();
	_nop_();
	while (!(ADC_CONTR & 0x20));            //查询ADC完成标志
	ADC_CONTR &= ~0x20;                     //清完成标志
	res = (ADC_RES<<8)|ADC_RESL;            //读取ADC结果
	
	return res;
}
#endif



/*****************************************************************************
函数名称 : WriteCmd
功能描述 : 写指令函数
输入参数 : command：指令
返回参数 : 无
使用说明 : 无
*****************************************************************************/
void Get_Voltage()
{
	int res;
	
	int i;
	uint8_t g;
	ADC_init();
	ADC_read();
	ADC_read();
	res = 0;
	for(i=0;i<8;i++)
	{
		res += ADC_read();
	}
	res >>= 3;
	vcc = (int)(6600L*res>>12);
	g = (vcc+50)/1000;
	OLED_ShowChar(96,0,g+'0',8);
	OLED_ShowChar(104,0,'.',8);
	g = (vcc+50)%1000/100;
	OLED_ShowChar(112,0,g+'0',8);
	OLED_ShowChar(120,0,'V',8);
	
	
}
