/******************************************************************************
文件名称: Uart.c
文件标识: STC12SSA60S2
摘    要: Uart硬件操作函数
当前版本: V1.0	
完成日期: 2013.11.18
*******************************************************************************/
#define	USER_PWM_GLOBALS
#include "include.h"
#include "wifi.h"


/*****************************************************************************
函数名称 : pwm_init
功能描述 : pwm初始化
输入参数 : 无
返回参数 : 无
使用说明 : 无
*****************************************************************************/
void pwm_init(void)
{ 
    P_SW1 |= 0x20;
    P_SW1 &= 0xef;
    CCON = 0;                       //初始化PCA控制寄存器
    CL = 0;                         //复位PCA寄存器
    CH = 0;
    CMOD = 0x02;                    //设置PCA时钟源
                                    //禁止PCA定时器溢出中断
    PCA_PWM0 = 0x00;                //PCA模块0工作于8位PWM
    CCAP0H = CCAP0L = 0;         		//
    CCAPM0 = 0x42;                  //PCA模块0为8位PWM模式

    PCA_PWM1 = 0x00;                //PCA模块1工作于7位PWM
    CCAP1H = CCAP1L = 0;         		//
    CCAPM1 = 0x42;                  //PCA模块1为7位PWM模式

    PCA_PWM2 = 0x00;                //PCA模块2工作于6位PWM
    CCAP2H = CCAP2L = 0;         		//
    CCAPM2 = 0x42;                  //PCA模块2为6位PWM模式

    CR = 1;                         //PCA定时器开始工作
}
/*****************************************************************************
函数名称 : LED_RGB_Control
功能描述 : RGB_LED控制
输入参数 : r/g/b:亮度值
返回参数 : 无
使用说明 : 无
*****************************************************************************/
void LED_RGB_Control(unsigned char r,unsigned char g,unsigned char b)
{
    CCAP0H = CCAP0L = r;         
    CCAP1H = CCAP1L = g;         
    CCAP2H = CCAP2L = b;         
}